# Pandas.

In [26]:
import pandas as pd

### Series.
- One column.

In [77]:
s = pd.Series(["peach", "lilly", "dazy"])
print(s)

0    peach
1    lilly
2     dazy
dtype: object

### DataFrame, basics.
- Multiple columns.

###### 1. Initialization.

In [82]:
idx = pd.RangeIndex(start=1, stop=4, step=1)   #stop = n -> idx = [start, n-1]
df = pd.DataFrame(
    data = [
        ["peach", 182, 65],
        ["lilly", 145, 64],
        ["dazy", 165, 53]
    ],
    columns = ["Name", "Height", "Weight"],
    index = idx
)
print(df)

    Name  Height  Weight
1  peach     182      65
2  lilly     145      64
3   dazy     165      53

###### 2. Indexing.
- Indexing rows.

In [84]:
df.loc[[1,3]]

    Name  Height  Weight
1  peach     182      65
3   dazy     165      53

- Indexing columns.

In [83]:
df[['Name', 'Height']]

    Name  Height
1  peach     182
2  lilly     145
3   dazy     165

- Indexing rows & columns.

In [86]:
df.loc[
    [1,3],       #rows.
    ['Name']     #columns.
]

    Name
1  peach
3   dazy

- Indexing by location.

In [87]:
df.iloc[
    [1],        #row in first position.
    [1]         #column in first position.
]

   Height
2     145

- Indexing by conditions.

In [88]:
df.loc[
    (df['Height'] < 180) &
    (df['Name'] == 'dazy')
]

   Name  Height  Weight
3  dazy     165      53

###### 3. Update.
- should copy first, then update!

In [90]:
#Copy.
df2 = df.copy()
print(df2)

    Name  Height  Weight
1  peach     182      65
2  lilly     145      64
3   dazy     165      53

In [93]:
#Update.
df2.loc[
    [1],
    ['Height']
] = 175
print(df2)

    Name  Height  Weight
1  peach     175      65
2  lilly     145      64
3   dazy     165      53

###### 4. Delete.
drop() does not change the original, only returns the result.
- Drop rows.

In [94]:
df2.drop(index=[1,3])

    Name  Height  Weight
2  lilly     145      64

- Drop columns.

In [95]:
df2.drop(columns=['Height'])

    Name  Weight
1  peach      65
2  lilly      64
3   dazy      53

- Drop rows by condition.

In [111]:
df2.drop(df[df.Height < 170].index)

    Name  Height  Weight
1  peach     175      65

### DataFrame, advanced ftns.

In [100]:
df

    Name  Height  Weight
1  peach     182      65
2  lilly     145      64
3   dazy     165      53

###### 1. Print.

In [101]:
df.head(2)

    Name  Height  Weight
1  peach     182      65
2  lilly     145      64

In [102]:
df.tail(2)

    Name  Height  Weight
2  lilly     145      64
3   dazy     165      53

###### 2. Sort.
- Sort by index.

In [103]:
df.sort_index(ascending=False)

    Name  Height  Weight
3   dazy     165      53
2  lilly     145      64
1  peach     182      65

- Sort by column's value.

In [106]:
df.sort_values(by=['Height', 'Weight'], ascending=True)   #by Height first, then by Weight if the values of Height are equal.

    Name  Height  Weight
2  lilly     145      64
3   dazy     165      53
1  peach     182      65

###### 3. Merge & Split.

###### 4. Domain-specific classes.